<template>
    <v-main>                                               
      <v-container class="fill-height d-flex align-center justify-center">
        <v-card class="pa-4" elevation="3" rounded="lg" max-width="800" height="80vh">
          <v-card-title class="text-h6 font-weight-bold">
            利用規約
          </v-card-title>
          <v-card-subtitle class="text-caption mb-2">
            最終更新日：2025年4月17日
          </v-card-subtitle>
          <v-divider></v-divider>
    
          <v-card-text class="terms-content mt-3">
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第1条（適用）</h3>
              <ol class="pl-6">
                <li>本規約は，ユーザーと管理者との間の本サービスの利用に関わる一切の関係に適用されるものとします。</li>
              </ol>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第2条（リプレイの登録）</h3>
              <ol class="pl-6">
                <li>本サービスにおいては，ユーザが本規約に同意の上，管理者の定める方法によってリプレイを投稿することができます。</li>
                <li>本サービスにおいては，1ユーザにつき1つのスコア記録リプレイのみ投稿できるものとします。ただし，スコア記録以外の目的による投稿（初クリア，縛りプレイ等）については，管理者の判断により複数投稿を認めることがあります。</li>
                <li>ユーザーが本サービスにおいて新しいスコア記録リプレイを投稿する場合，第3条に従ってリプレイの削除要求を行うものとします。</li>
              </ol>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第3条（リプレイの削除・パスワードの管理）</h3>
              <ol class="pl-6">
                <li>ユーザーは，自己の責任において，リプレイ投稿時に設定した削除用パスワードを適切に管理するものとします。</li>
                <li>管理者は，リプレイと削除パスワードの組み合わせが登録情報と一致したうえで削除要求された場合には，そのリプレイを登録しているユーザー自身による削除要求とみなしリプレイを削除します。</li>
                <li>削除パスワードが第三者によって使用されたことによって生じた損害は，管理者に故意又は重大な過失がある場合を除き，管理者は一切の責任を負わないものとします。</li>
              </ol>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第4条（禁止事項）</h3>
              <p>ユーザーは本サービスの利用にあたり、以下の行為をしてはなりません。これらの行為が確認されたユーザーに対して，管理者はユーザーが投稿したリプレイの削除，及びユーザの利用停止を行うことが可能です。ただし，当該行為が明らかにジョークやパロディ等の『ネタ』であり，管理者が問題ないと判断した場合は，この限りではありません。</p>
              <ol class="pl-6">
                <li>法令または公序良俗に違反する行為</li>
                <li>犯罪行為に関連する行為</li>
                <li>管理者，本サービスの他のユーザー，または第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為</li>
                <li>管理者の管理するサービスの運営を妨害するおそれのある行為</li>
                <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
                <li>不正アクセスをし，またはこれを試みる行為</li>
                <li>他のユーザーに成りすます行為</li>
                <li>新しいスコア記録として新規リプレイを登録したのにも関わらず古いリプレイを削除しない行為</li>
                <li>VsyncPatchを除く外部ツールを使用したリプレイを投稿する行為</li>
                <li>管理者の管理するサービスに関連して，反社会的勢力に対して直接または関節に利益を供与する行為</li>
                <li>管理者，本サービスの他のユーザーまたは第三者の知的財産権，肖像権，プライバシー，名誉その他の権利または利益を侵害する行為</li>
                <li>
                  以下の表現を含み，または含むと管理者が判断する内容を本サービス上に投稿し，または送信する行為
                  <ul class="pl-6">
                    <li>過度に暴力的な表現</li>
                    <li>露骨な性的表現</li>
                    <li>人種，国籍，信条，性別，社会的身分，門地等による差別につながる表現</li>
                    <li>自殺，自傷行為，薬物乱用を誘引または助長する表現</li>
                    <li>その他反社会的な内容を含み他人に不快感を与える表現</li>
                  </ul>
                </li>
                <li>宗教活動または宗教団体への勧誘行為</li>
                <li>その他，管理者が不適切と判断する行為</li>
              </ol>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第5条（本サービスの提供の停止等）</h3>
              <ol class="pl-6">
                <li>
                  管理者は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
                  <ul class="pl-6">
                    <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
                    <li>地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合</li>
                    <li>コンピュータまたは通信回線等が事故により停止した場合</li>
                    <li>その他，管理者が本サービスの提供が困難と判断した場合</li>
                  </ul>
                </li>
                <li>管理者は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。</li>
                <li>本サービスが終了する場合，管理者は，パスワード等の個人情報を除いた当サービスに関するデータを，後継者または引継ぎを行う第三者に提供できるものとします。</li>
              </ol>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第6条（著作権）</h3>
              <ol class="pl-6">
                <li>ユーザーは，自ら作成したリプレイのみ，本サービスを利用し，投稿ないしアップロードすることができるものとします。</li>
                <li>ユーザーが本サービスを利用して投稿ないしアップロードしたリプレイ，文章等については，当該ユーザーに留保されるものとします。ただし，管理者は，本サービスを利用して投稿ないしアップロードされたリプレイ，文章等について，本サービスの改良，品質の向上，または不備の是正等ならびに本サービスの周知宣伝等に必要な範囲で利用できるものとし，ユーザーは，この利用に関して，著作者人格権を行使しないものとします。</li>
              </ol>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第7条（保証の否認および免責事項）</h3>
              <ol class="pl-6">
                <li>管理者は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</li>
                <li>管理者は，本サービスに起因してユーザーに生じたあらゆる損害について，管理者の故意又は重過失による場合を除き，一切の責任を負いません。ただし，本サービスに関する管理者とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。</li>
                <li>前項ただし書に定める場合であっても，管理者は，管理者の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（管理者またはユーザーが損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。</li>
                <li>管理者は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。</li>
              </ol>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第8条（サービス内容の変更など）</h3>
              <p>
                  管理者は，ユーザーへの予告なく，本サービスの内容を変更，追加または廃止することがあり，ユーザーはこれを承諾するものとします。
              </p>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第9条（利用規約の変更）</h3>
              <ol class="pl-6">
                <li>
                  管理者は以下の場合には，ユーザーの個別の同意を要せず，本規約を変更することができるものとします。
                  <ol class="pl-6">
                    <li>本規約の変更がユーザーの一般の利益に適合するとき。</li>
                    <li>本規約の変更が本サービス利用契約の目的に反せず，かつ，変更の必要性，変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。</li>
                  </ol>
                </li>
                <li>管理者は，ユーザーに対し，X(旧Twitter)，または適切な方法により，事前に本規約を変更する旨および変更後の内容並びにその効力発生時期を通知します。</li>
              </ol>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第10条（個人情報の取り扱い）</h3>
              <ol class="pl-6">
                <li>管理者は，ユーザーから提供された削除パスワード，またはその他個人を特定できる情報（以下「個人情報」といいます）を、適切に取り扱うものとし、プライバシーの保護に最大限配慮します。</li>
                <li>
                  管理者は、取得した個人情報を以下の目的のために利用します。
                  <ol class="pl-6">
                    <li>本サービスの提供および運営のため</li>
                    <li>利用状況の分析やサービス改善のため（個人を特定しない範囲での統計データ作成を含む）</li>
                  </ol>
                </li>
                <li>
                  管理者は，次のいずれかに該当する場合を除き，個人情報を第三者に開示または提供しません。
                  <ol class="pl-6">
                    <li>ユーザー本人の同意がある場合</li>
                    <li>法令に基づき開示を求められた場合</li>
                    <li>人の生命、身体または財産の保護のために必要があり、本人の同意を得ることが困難な場合</li>
                  </ol>
                </li>
                <li>ユーザーは、自己の個人情報について、開示、訂正、利用停止等を希望する場合は、管理者所定の手続により請求することができます。管理者は、本人確認のうえ、合理的な期間内に対応します。</li>
              </ol>
            </section>
            <section class="mb-4">
              <h3 class="text-subtitle-2 font-weight-medium">第11条（権利義務の譲渡の禁止）</h3>
              <p>ユーザーは，管理者の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。</p>
            </section>
            <section>
              <h3 class="text-subtitle-2 font-weight-medium">第12条（準拠法）</h3>
              <p>
                本規約の解釈には日本法を準拠法とします。
              </p>
            </section>
          </v-card-text>
        </v-card>
      </v-container>
    </v-main>
  </template>
  
  <style scoped>
  .terms-content {
    overflow-y: auto;
    height: calc(80vh - 120px); /* カード全体の高さからタイトル・余白を引いた高さ */
    padding-right: 8px; /* スクロールバーのスペース */
    line-height: 1.6;
    font-size: 0.9rem;
  }
  </style>